---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.Duct
zh: 风管
source: html/72548466-370d-b010-eb4d-cde0c3f72482.htm
---
# Autodesk.Revit.DB.Mechanical.Duct

**中文**: 风管

A duct in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class Duct : MEPCurve
```

## Remarks
The duct is only available in the Autodesk Revit MEP product.